EAtest/T16/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     overInterDyMFoam ;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         12.0;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.3;

maxAlphaCo      0.3;

maxDeltaT       0.001;


functions
{
	line1
	{
		type	probesCable;	
		libs	("libsampling.so");
		fields	(U);
		probeLocations
		(
			#include "pointLocation1.txt"
			
		);
	}
	line2
	{
		type	probesCable;	
		libs	("libsampling.so");
		fields	(U);
		probeLocations
		(
			#include "pointLocation2.txt"
		);
	}
	line3
	{
		type	probesCable;	
		libs	("libsampling.so");
		fields	(U);
		probeLocations
		(
			#include "pointLocation3.txt"
		);
	}
	line4
	{
		type	probesCable;	
		libs	("libsampling.so");
		fields	(U);
		probeLocations
		(
			#include "pointLocation4.txt"
		);
	}
}


// ************************************************************************* //
